# CannotCopyWallPanelsWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyWallPanelsWarn Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Cannot copy wall panels unless their parent wall is also being copied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyWallPanelsWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyWallPanelsWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyWallPanelsWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace